---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.RailingType
source: html/61712b79-757e-fe5c-b5cd-0d951dc26f6a.htm
---
# RailingType Properties

The id of the assembly instance to which the element belongs.